### Q1. List any five functions of the pandas library with execution.

1. read_csv(): This function is used to read data from a CSV file and create a DataFrame.
2. head(): It returns the first n rows of a DataFrame, where n is an optional parameter (default is 5).
3. info(): This function provides a concise summary of a DataFrame, including column names, data types, and the number of non-null values.
4. describe(): It generates descriptive statistics of a DataFrame, including count, mean, standard deviation, minimum, maximum, and quartile values.
5. groupby(): This function is used to group data in a DataFrame based on one or more columns, allowing for aggregation and analysis.

In [4]:
import pandas as pd

df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [8]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [11]:
grouped_data = df.groupby('Survived')['Fare'].mean()
print(grouped_data)

Survived
0    22.117887
1    48.395408
Name: Fare, dtype: float64

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [24]:
def reindex_dataframe(df):
    df = df.reset_index(drop=True)
    df.index = df.index.map(lambda x: x*2+1)
    return df

data= {'A':[1,2,3],
       'B':[4,5,6],
       'C':[7,8,9]}
df=pd.DataFrame(data)
print(df)
df = reindex_dataframe(df)
print(df)

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9
   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
### For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [36]:
def col_sum(df,col_name):
    sum=0
    for i in df[col_name][0:3]:
        sum=sum+i
    return sum


data = {'id':[1,2,3,4,5],
        'values': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)

ans = col_sum(df,'values')
print(ans)

60

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [43]:
def word_count(df, col_name):
    count_list=[]
    for i in df[col_name]:
        count_list.append(len(i.split()))
    df["Word_Count"]=count_list
    return df

data = {'Text':["Hello world",'I want to become data scientist', "pwskills is best"]}
df= pd.DataFrame(data)
df = word_count(df,"Text")
print(df)

                              Text  Word_Count
0                      Hello world           2
1  I want to become data scientist           6
2                 pwskills is best           3

### Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size:

1. DataFrame.size returns the total number of elements in the DataFrame, which is equal to the product of the number of rows and the number of columns.
2. It provides the total count of all elements, including NaN or missing values.
3. The size attribute does not take into account the data types of the elements.
4. It returns a single value representing the size of the DataFrame.
5. The size attribute is not a function and does not require parentheses.

DataFrame.shape:

1. DataFrame.shape returns a tuple that represents the dimensions of the DataFrame.
2. It provides the number of rows and the number of columns in the DataFrame.
3. The shape attribute does not count missing or NaN values; it only considers the actual data present in the DataFrame.
4. It returns a tuple in the format (number_of_rows, number_of_columns).
5. The shape attribute is not a function and does not require parentheses.

### Q6. Which function of pandas do we use to read an excel file?

we use pd.read.excel("file name") to read excel file

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. The username is the part of the email address that appears before the '@' symbol. 
### For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [51]:
def user_name(df):
    username=[]
    for i in df["email"]:
        username.append(i.split('@')[0])
    df['Username']=username
    return df

df=pd.DataFrame({'email':["kunal@gmail.com",'goranshi@gmail.com','mona@gmail.com','divek@gmail.com','manish@gmail.com']})
user_name(df)

                email  Username
0     kunal@gmail.com     kunal
1  goranshi@gmail.com  goranshi
2      mona@gmail.com      mona
3     divek@gmail.com     divek
4    manish@gmail.com    manish

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.
### For example, if df contains the following values:
1. A B C
2. 3 5 1
3. 8 2 7
4. 6 10 4
5. 2 3 5
6. 9 1 2

Your function should select the following rows: A B C

1. 8 2 7
2. 9 1 2

The function should return a new DataFrame that contains only the selected rows.

In [63]:
def check_row(df):
    select_row =  df[(df['A']>5) & (df['B']<10 )]
    return select_row

data= {'A': [3, 8, 6, 2, 9],
       'B': [5, 2, 10, 3, 1],
       'C': [1, 7, 4, 5, 2]}
df= pd.DataFrame(data)
print(check_row(df))

   A  B  C
1  8  2  7
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [74]:
df = pd.DataFrame({'values':[42,53,64,35,27,43,56,35]})
mean= df['values'].mean()
median= df['values'].median()
mode= df['values'].mode()
sd= df['values'].std()


print(f"mean is: {mean}")
print(f"median is: {median}")
print(f"mode is: {mode}")
print(f"srandard deviation is: {sd}")

mean is: 44.375
median is: 42.5
mode is: 0    35
Name: values, dtype: int64
srandard deviation is: 12.42046122907105

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [75]:

def calculate_moving_average(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

# Example usage
df = pd.DataFrame({'Date': pd.date_range(start='2023-06-01', periods=10),
                   'Sales': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]})

calculate_moving_average(df)
print(df)

        Date  Sales  MovingAverage
0 2023-06-01     10           10.0
1 2023-06-02     20           15.0
2 2023-06-03     30           20.0
3 2023-06-04     40           25.0
4 2023-06-05     50           30.0
5 2023-06-06     60           35.0
6 2023-06-07     70           40.0
7 2023-06-08     80           50.0
8 2023-06-09     90           60.0
9 2023-06-10    100           70.0

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:
Date
0. 2023-01-01
1. 2023-01-02
2. 2023-01-03
3. 2023-01-04
4. 2023-01-05

Your function should create the following DataFrame:

Date Weekday
0. 2023-01-01 Sunday
1. 2023-01-02 Monday
2. 2023-01-03 Tuesday
3. 2023-01-04 Wednesday
4. 2023-01-05 Thursday

The function should return the modified DataFrame.

In [80]:
def add_weekday_column(df):
    df['Weekday'] = df['Date'].dt.strftime('%A')
    return df

# Example usage
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']})
df['Date'] = pd.to_datetime(df['Date'])

df = add_weekday_column(df)
print(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [83]:
def select_rows_between_dates(df):
    start_date = pd.to_datetime('2023-01-01')
    end_date = pd.to_datetime('2023-01-31')
    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]
    return selected_rows

df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-15', '2023-01-31', '2023-02-10']})
df['Date'] = pd.to_datetime(df['Date'])  
selected_df = select_rows_between_dates(df)
print(selected_df)

        Date
0 2023-01-01
1 2023-01-15
2 2023-01-31

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

we use pandas library to use pandas function